-- MySQL dump 10.13  Distrib 5.7.31, for Win64 (x86_64)
--
-- Host: localhost    Database: quiz_app
-- ------------------------------------------------------
-- Server version	5.7.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `options`
--

DROP TABLE IF EXISTS `options`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `options` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `question_id` int(11) NOT NULL,
  `option_text` varchar(255) CHARACTER SET utf8mb4 NOT NULL,
  PRIMARY KEY (`id`),
  KEY `question_id` (`question_id`),
  CONSTRAINT `options_ibfk_1` FOREIGN KEY (`question_id`) REFERENCES `questions` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=183 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `options`
--

LOCK TABLES `options` WRITE;
/*!40000 ALTER TABLE `options` DISABLE KEYS */;
INSERT INTO `options` VALUES (1,1,'产量特别高的水稻'),(2,1,'米质特别好的水稻'),(3,1,'抗性特别好的水稻'),(4,2,'玉米'),(5,2,'大豆'),(6,2,'高粱'),(7,3,'水稻'),(8,3,'玉米'),(9,3,'马铃薯'),(10,4,'30年代'),(11,4,'50年代'),(12,4,'70年代'),(13,5,'不可以'),(14,5,'可以'),(15,5,'无所谓'),(16,6,'胞间连丝'),(17,6,'纤维素'),(18,6,'纤丝'),(19,6,'木质'),(20,7,'玉米'),(21,7,'瘦肉精（盐酸克伦特罗）'),(22,7,'食盐'),(23,7,'维生素'),(24,8,'种植、初加工、深加工'),(25,8,'养殖、初加工、深加工'),(26,9,'110℃～130℃'),(27,9,'135℃～150℃'),(28,9,'180℃～250℃'),(29,9,'200℃～250℃'),(30,10,'玉米'),(31,10,'马铃薯'),(32,10,'蔬菜'),(33,10,'棉花'),(34,11,'氮肥、磷肥、钾肥'),(35,11,'磷肥、钾肥、氮肥'),(36,11,'钾肥、氮肥、磷肥'),(37,11,'钾肥、磷肥、氮肥'),(38,12,'环境效应'),(39,12,'文化价值'),(40,12,'观赏价值'),(41,13,'中国植树节（3月12日）；地球日（4月22日）'),(42,13,'生物多样性日（5月22日）（正确12月29日）；世界环境日（6月6日）（正确6月5日）'),(43,13,'国际臭氧层保护日（9月16日）；国际生物多样性日（5月22日）'),(44,13,'世界湿地日为每年的：（2月2日）'),(45,14,'大气、市容、土壤、生物、噪声'),(46,14,'大气、水体、土壤、生物、噪声'),(47,14,'大气、交通、土壤、生物、噪声'),(48,14,'大气、水体、土壤、生物、尾气'),(49,15,'民族团结'),(50,15,'扶贫'),(51,15,'环境保护'),(52,15,'资源开发'),(53,16,'追求时尚 保护环境'),(54,16,'保护环境 崇尚自然'),(55,16,'保护环境 适度消费'),(56,16,'开发资源 享受生活'),(57,17,'保护衣物'),(58,17,'防止污染，防止水体富养化'),(59,17,'保护双手'),(60,18,'上胚轴'),(61,18,'下胚轴'),(62,18,'胚根'),(63,18,'胚芽'),(64,19,'喀纳斯湖保护区'),(65,19,'天池保护区'),(66,19,'阿尔金山保护区'),(67,19,'祁连山保护区'),(68,20,'科技'),(69,20,'经济'),(70,20,'环保'),(71,20,'文化'),(72,21,'叶隙'),(73,21,'叶迹'),(74,21,'形成层'),(75,21,'离层'),(76,22,'9'),(77,22,'10'),(78,22,'11'),(79,22,'12'),(80,23,'1995年'),(81,23,'1996年'),(82,23,'1997年'),(83,23,'1998年'),(84,24,'200吨'),(85,24,'300吨'),(86,24,'400吨'),(87,24,'500吨'),(88,25,'农村、农业和农民'),(89,25,'农具、农业和农民'),(90,25,'农技、农业和农民'),(91,25,'农化、农业和农医'),(92,26,'给予、创收和放活'),(93,26,'开放、创新和综合治理'),(94,26,'多予，少取和开放'),(95,26,'多予，少取和放活'),(96,27,'机械化、产业化'),(97,27,'电气化、产业化、商品化'),(98,27,'机械化、电气化、产业化、商品化'),(99,27,'机械化、产业化、商品化'),(100,28,'米类、豆类和薯类'),(101,28,'谷类、蔬类和薯类'),(102,28,'谷类、豆类和薯类'),(103,29,'生态效益，社会效益，经济效益'),(104,29,'环境效益，社会效益，经济效益'),(105,29,'生态效益，环境效益，经济效益'),(106,30,'病虫害，乱砍滥伐，植树造林'),(107,30,'病虫害，森林火灾，偷盗伐木'),(108,30,'森林火灾，病虫害，乱砍滥伐'),(109,31,'垃圾污染'),(110,31,'大气污染'),(111,31,'土地荒漠污染'),(112,32,'维A'),(113,32,'维D'),(114,32,'维C'),(115,33,'可逆性'),(116,33,'可塑性'),(117,33,'弹性'),(118,33,'刚性'),(119,34,'21%'),(120,34,'31%'),(121,34,'41%'),(122,35,'配子'),(123,35,'孢子'),(124,35,'合子'),(125,35,'种子'),(126,36,'器官'),(127,36,'分子'),(128,36,'组织'),(129,36,'细胞'),(130,37,'细菌'),(131,37,'真菌'),(132,37,'病毒'),(133,38,'50%'),(134,38,'20%'),(135,38,'10%'),(136,38,'1%'),(137,39,'杂交水稻之父'),(138,39,'中国水稻之父'),(139,39,'亚洲水稻之父'),(140,40,'心脏'),(141,40,'骨髓'),(142,40,'脊髓'),(143,40,'大脑'),(144,41,'破坏细菌的核酸'),(145,41,'破坏细菌的糖类'),(146,41,'破坏细菌的脂类'),(147,42,'珠心组织'),(148,42,'胎座'),(149,42,'珠被'),(150,42,'珠柄'),(151,43,'梨果'),(152,43,'瓠果'),(153,43,'柑果'),(154,43,'聚花果'),(155,44,'孢子生殖'),(156,44,'异养'),(157,44,'菌丝'),(158,44,'产生担子果'),(159,45,'胚'),(160,45,'子叶'),(161,45,'糊粉层'),(162,45,'贮存淀粉的薄壁细胞'),(163,46,'1N和2N'),(164,46,'2N和3N'),(165,46,'3N和1N'),(166,46,'都是3N'),(167,47,'初生韧皮部'),(168,47,'初生木质部'),(169,47,'中柱鞘'),(170,47,'内皮层'),(171,48,'高大植物'),(172,48,'虫媒植物'),(173,48,'风媒植物'),(174,48,'分泌植物杀菌素'),(175,49,'H2O'),(176,49,'C6H12O6'),(177,49,'H2S'),(178,49,'CO2'),(179,50,'多甲藻'),(180,50,'硅藻'),(181,50,'绿藻'),(182,50,'轮藻');
/*!40000 ALTER TABLE `options` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `questions`
--

DROP TABLE IF EXISTS `questions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `questions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `question_text` text CHARACTER SET utf8mb4 NOT NULL,
  `type` enum('multiple','true_false') CHARACTER SET utf8mb4 NOT NULL,
  `correct_answer` varchar(255) CHARACTER SET utf8mb4 NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `questions`
--

LOCK TABLES `questions` WRITE;
/*!40000 ALTER TABLE `questions` DISABLE KEYS */;
INSERT INTO `questions` VALUES (1,'超级稻是指：','multiple','产量特别高的水稻'),(2,'下列作物中，哪个不是我国主要粮食作物？','multiple','高粱'),(3,'河北最大的粮食作物是：','multiple','玉米'),(4,'\"绿色革命\"发生在上世纪','multiple','50年代'),(5,'在有机食品生产过程中，是否可以使用化肥？','multiple','不可以'),(6,'细胞壁上（ ）的存在，使多细胞植物体在结构和生理功能上成为一个统一的有机体。','multiple','胞间连丝'),(7,'以下哪一种药物是国家明文禁止添加的违禁药物，不能作为饲料添加剂使用？','multiple','瘦肉精（盐酸克伦特罗）'),(8,'农产品加工按加工程度可分为：','multiple','养殖、初加工、深加工'),(9,'超高温杀菌技术的瞬间加热温度是：','multiple','135℃～150℃'),(10,'我市地膜覆盖面积最大的是以下哪一种农作物？','multiple','玉米'),(11,'氮、磷、钾化肥对环境产生危害从高到低的顺序是？','multiple','氮肥、磷肥、钾肥'),(12,'保护野生动植物不在范畴内的答案是：','multiple','观赏价值'),(13,'以下有关环境的纪念日名称和时间哪项有错？','multiple','生物多样性日（5月22日）（正确12月29日）；世界环境日（6月6日）（正确6月5日）'),(14,'环境监测的主要监测对象是：','multiple','大气、水体、土壤、生物、噪声'),(15,'我国确立（ ）为一项基本国策。','multiple','环境保护'),(16,'随着绿色消费运动的发展，全球已逐渐形成一种（ ）的生活风尚。','multiple','保护环境 崇尚自然'),(17,'选无磷洗衣粉的目的是：','multiple','防止污染，防止水体富养化'),(18,'大豆种子萌发形成子叶出土的幼苗，其主要原因是（ ）生长迅速。','multiple','下胚轴'),(19,'我国面积最大的自然保护区是：','multiple','阿尔金山保护区'),(20,'21世纪被称为（ ）世纪。','multiple','环保'),(21,'植物落叶主要是在叶柄基部产生了（ ）。','multiple','离层'),(22,'《中华人民共和国农业法》第八章关于农业资源与农业环境保护的表述共有多少条？','multiple','10'),(23,'《中华人民共和国野生植物保护条例》于哪一年颁布实施？','multiple','1997年'),(24,'加工多少吨塑料粒子以上才能享受项目资金补贴？','multiple','400吨'),(25,'什么是三农问题？','multiple','农村、农业和农民'),(26,'解决三农问题的基本方针是什么？','multiple','多予，少取和放活'),(27,'现代农业的构成要素有哪些？','multiple','机械化、电气化、产业化、商品化'),(28,'按照植物学特征和用途，粮食作物分为哪三类？','multiple','谷类、豆类和薯类'),(29,'森林的三大效益是什么？','multiple','生态效益，社会效益，经济效益'),(30,'林业的\"三害\"是什么？','multiple','森林火灾，病虫害，乱砍滥伐'),(31,'世界十大环境污染之首是：','multiple','大气污染'),(32,'补充哪种维生素有利于儿童骨骼生长？','multiple','维D'),(33,'细胞生长时，细胞壁表现一定的（ ）。','multiple','弹性'),(34,'清洁的空气中含有多少氧？','multiple','21%'),(35,'无性生殖是植物体产生许多称为（ ）的生殖细胞不经结合而直接发育成新个体的生殖方式。','multiple','孢子'),(36,'生物体的基本单位是：','multiple','细胞'),(37,'去年流行的SARS的病原体是：','multiple','病毒'),(38,'人类基因组计划中中国参与测定的部分占全部的：','multiple','1%'),(39,'我国著名科学家袁隆平被称为：','multiple','杂交水稻之父'),(40,'人类的主要造血器官是：','multiple','骨髓'),(41,'紫外线能够杀菌的主要原因是：','multiple','破坏细菌的核酸'),(42,'外胚乳是由下列哪一结构发育而来的？','multiple','珠心组织'),(43,'下列果实的类型中，不属于假果的是：','multiple','梨果'),(44,'所有菌类的特征是：','multiple','孢子生殖'),(45,'赤霉素诱导α-淀粉酶合成的部位是：','multiple','糊粉层'),(46,'被子植物和裸子植物的胚乳分别是：','multiple','3N和1N'),(47,'多年生木本植物根中保留的初生结构是：','multiple','初生木质部'),(48,'悬铃木花粉过敏推测其传粉方式为：','multiple','风媒植物'),(49,'绿色硫细菌光合作用的电子供体是：','multiple','H2S'),(50,'能够进行光合作用但细胞壁中不含纤维素的植物是：','multiple','多甲藻');
/*!40000 ALTER TABLE `questions` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-22 18:21:01
